uat_chat/Catalogs/ItobТерминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ItobТерминалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IMEI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobМоделиТерминалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерSimКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Датчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Датчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ItobДатчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ItobНазначенияДатчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КалибровочныйГрафик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ItobКалибровочныеГрафики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Catalogs/ItobТерминалы/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	// Контроль заполнения таблицы датчиков
	
	Для каждого СтрокаДатчики Из Датчики Цикл
		Если СтрокаДатчики.Датчик.Пустая() Тогда
			Отказ = Истина;
			Сообщить(НСтр("ru = 'Таблица датчиков, строка №"+СтрокаДатчики.НомерСтроки+", не указан датчик!'"));		
		КонецЕсли;
		
		Если СтрокаДатчики.Назначение.Пустая() Тогда
			Отказ = Истина;
			Сообщить(НСтр("ru = 'Таблица датчиков, строка №"+СтрокаДатчики.НомерСтроки+", не указано назначение датчика!'"));		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

// Процедура - обработчик события ПриЗаписи.
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	ItobВызовСервера.ЗаписатьСтрокуВРегистрПрав(Ссылка);
	
КонецПроцедуры
